app/controllers/comments_controller.rb

    # Access tokens are valid for approximately one hour and must be regenerated.?
    # If using IAM
    include IBMWatson
    authenticator =Authenticators::IamAuthenticator.new( #IBMWatson::Authenticators::IamAuthenticator.new(
    apikey:ENV['NATURAL_LANGUAGE_UNDERSTANDING_APIKEY']
    )
    NLU = IBMWatson::NaturalLanguageUnderstandingV1.new(
    authenticator: authenticator,
    version: "2020-08-01"#"2019-07-12"
    )
    NLU.service_url = ENV['NATURAL_LANGUAGE_UNDERSTANDING_URL']#"https://api.us-east.natural-language-understanding.watson.cloud.ibm.com/instances/21007ec0-edd4-43f7-a8d6-3b61d569b4ac"

    def watson_nlu(payload)
        NLU.analyze(payload)
    end



    def index
        comments=Comment.all
        render json: comments
    end

    def show
        comment=Comment.find_by(id:params[:id])
---
SELECT "comments".* FROM "comments" ORDER BY created_at desc
SELECT "comments".* FROM "comments" WHERE "comments"."id" = $1 ORDER BY created_at desc LIMIT $2  [["id", 1], ["LIMIT", 1]]

    def create
        # comment=Comment.create(comment_params)
        # if comment.valid?
        begin
            response =  watson_nlu( # NLU.analyze(
                text:params[:user_comment],
                # text:comment.user_comment,
                features: {
                    "emotion"=>{},
                    "sentiment"=>{}
                }
            ).result
        rescue  IBMWatson::ApiException => ex
            # print "Method failed with status code #{ex.code}: #{ex.error}"
            # print "ex #{ex}"
        end
        #response = NLU.analyze( text:params[:user_comment],features: {"emotion"=>{}, "sentiment"=>{}})

        # byebug
        if response
            # puts @user
            comment=Comment.create(user_comment:params[:user_comment],user:@user)
            # comment=Comment.create(comment_params)
            emotion=WatsonEmotion.create(user:@user,comment_id:comment.id,sadness:response["emotion"]["document"]["emotion"]["sadness"],joy:response["emotion"]["document"]["emotion"]["joy"],fear:response["emotion"]["document"]["emotion"]["fear"],disgust:response["emotion"]["document"]["emotion"]["disgust"],anger:response["emotion"]["document"]["emotion"]["anger"])
            sentiment=WatsonSentiment.create(user:@user,comment_id:comment.id,score:response["sentiment"]["document"]["score"],label:response["sentiment"]["document"]["label"])
---
INSERT INTO "comments" ("user_comment", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["user_comment", "hot chocolate chip cookies are soft and yummy"], ["user_id", 1], ["created_at", "2021-02-01 16:01:25.718561"], ["updated_at", "2021-02-01 16:01:25.718561"]]
INSERT INTO "watson_emotions" ("sadness", "joy", "fear", "disgust", "anger", "created_at", "updated_at", "comment_id", "user_id") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9) RETURNING "id"
INSERT INTO "watson_sentiments" ("score", "label", "created_at", "updated_at", "comment_id", "user_id") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["score", 0.970974], ["label", "positive"], ["created_at", "2021-02-01 16:01:25.742858"], ["updated_at", "2021-02-01 16:01:25.742858"], ["comment_id", 9], ["user_id", 1]]

    def update
        # byebug
        comment=Comment.find_by(id:params[:id])
---
SELECT "comments".* FROM "comments" WHERE "comments"."id" = $1 ORDER BY created_at desc LIMIT $2  [["id", 9], ["LIMIT", 1]]

    def destroy
        # byebug
        comment=Comment.find_by(id:params[:id])
        emotion=WatsonEmotion.find_by(comment_id:comment.id)
        sentiment=WatsonSentiment.find_by(comment_id:comment.id)
        # emotion=WatsonEmotion.create(comment_id:comment.id,sadness:response["emotion"]["document"]["emotion"]["sadness"],joy:response["emotion"]["document"]["emotion"]["joy"],fear:response["emotion"]["document"]["emotion"]["fear"],disgust:response["emotion"]["document"]["emotion"]["disgust"],anger:response["emotion"]["document"]["emotion"]["anger"])
        # sentiment=WatsonSentiment.create(comment_id:comment.id,score:response["sentiment"]["document"]["score"],label:response["sentiment"]["document"]["label"])
        comment.delete
        emotion.delete
        sentiment.delete
---
SELECT "comments".* FROM "comments" WHERE "comments"."id" = $1 ORDER BY created_at desc LIMIT $2  [["id", 6], ["LIMIT", 1]]
SELECT "watson_emotions".* FROM "watson_emotions" WHERE "watson_emotions"."comment_id" = $1 LIMIT $2  [["comment_id", 6], ["LIMIT", 1]]
SELECT "watson_sentiments".* FROM "watson_sentiments" WHERE "watson_sentiments"."comment_id" = $1 LIMIT $2  [["comment_id", 6], ["LIMIT", 1]]
DELETE FROM "watson_emotions" WHERE "watson_emotions"."id" = $1  [["id", 3]]
DELETE FROM "watson_sentiments" WHERE "watson_sentiments"."id" = $1  [["id", 3]]
DELETE FROM "comments" WHERE "comments"."id" = $1  [["id", 6]]
DELETE FROM "watson_emotions" WHERE "watson_emotions"."id" = $1  [["id", 6]]
DELETE FROM "watson_sentiments" WHERE "watson_sentiments"."id" = $1  [["id", 6]]