app/controllers/users_controller.rb

SELECT "users".* FROM "users" WHERE "users"."username" = $1 LIMIT $2  [["username", "Sam"], ["LIMIT", 1]]
---
    def login
    #   byebug
      @user = User.find_by(username: params[:username])